In [1]:
import pandas as pd

dataframe1 = pd.DataFrame({'A':['A0','A1','A2'],
                           'B':['B0','B1','B2']})

dataframe2 = pd.DataFrame({'A':['A3','A4','A5'],
                           'B':['B3','B4','B5']})

dataframe3 = pd.DataFrame({'A':['A6','A7','A8'],
                           'B':['B6','B7','B8']})

## concat for row
result = pd.concat([dataframe1,dataframe2,dataframe3])
result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5
0  A6  B6
1  A7  B7
2  A8  B8

In [14]:
## concat for row
result = pd.concat([dataframe1,dataframe2,dataframe3], ignore_index=True)
result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5
6  A6  B6
7  A7  B7
8  A8  B8

In [17]:
## multi index
result = pd.concat([dataframe1,dataframe2,dataframe3],keys=['x','y','z'])
result

      A   B
x 0  A0  B0
  1  A1  B1
  2  A2  B2
y 0  A3  B3
  1  A4  B4
  2  A5  B5
z 0  A6  B6
  1  A7  B7
  2  A8  B8

In [5]:
## print index
result.index

MultiIndex([('x', 0),
            ('x', 1),
            ('x', 2),
            ('y', 0),
            ('y', 1),
            ('y', 2),
            ('z', 0),
            ('z', 1),
            ('z', 2)],
           )

In [9]:
## concat new column
dataframe4 = pd.DataFrame({'C':['C0','C1','C2'],
                           'D':['D0','D1','D2']})

result = pd.concat([dataframe1,dataframe4],axis=1)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [10]:
## concat new column(different data number)
dataframe4 = pd.DataFrame({'C':['C0','C1'],
                           'D':['D0','D1']})

result = pd.concat([dataframe1,dataframe4],axis=1)
result

    A   B    C    D
0  A0  B0   C0   D0
1  A1  B1   C1   D1
2  A2  B2  NaN  NaN

In [11]:
## concat new column(different data number inner)
dataframe4 = pd.DataFrame({'C':['C0','C1'],
                           'D':['D0','D1']})

result = pd.concat([dataframe1,dataframe4],axis=1, join='inner')
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [21]:
## concat new column(standard is 'B'))
dataframe4 = pd.DataFrame({'B':['B0','B1'],
                           'C':['C0','C1'],
                           'D':['D0','D1']})

pd.merge(dataframe1,dataframe4,on='B')

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [28]:
pd.merge(dataframe1,dataframe4,how="left",on='B')
pd.merge(dataframe1,dataframe4,how="right",on='B')
pd.merge(dataframe1,dataframe4,how="inner",on='B')
pd.merge(dataframe1,dataframe4,how="outer",on='B')

    A   B    C    D
0  A0  B0   C0   D0
1  A1  B1   C1   D1
2  A2  B2  NaN  NaN